{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "bmc-logo.png",
    "link": "https://www.buymeacoffee.com/Dr_Bewd",
    "text": "Dr_Bewd"
  },
  "text": {
    "more": "You can use the search bar to search for a specific game. For the best experience, it is recommended to view this page on a computer. When you click on a game\u0027s node, you\u0027ll automatically visualize a subset of the network (the game\u0027s 'ego-network') with some game-specific information.\n\nGames: All games that received at least 1 vote appear here.\n\nModularity class: This defines groups of games clustered together using the Modularity Optimization Algorithm for community detection. The games with a given color tend to be more densly connected to other games of that color.\n\nscore_f: This is the total score reached by the game in this year\u0027s voting. The size of each node is scaled using this value.\n\nEigenvector Centrality: A Measure telling you how well-connected a node is. The closer it is to 1, the more frequently a game appears on lists containing other well-connected games. You can see this as an indicator of the game\u0027s popularity where 1 is the maximum and 0 the minimum.\n\nConnections: This is a list of games that appeard on a user\u0027s list at least twice together with the game that you\u0027re currently looking at. Please, note that this year there were only 120 voters so this is more of a proof of concept.",
    "intro": "Network visualization of 2023 People\u0027s Choice Top Games With Two created by Dr_Bewd",
    "title": "BGG\u0027s top 2 player games (2023)"
  },
  "legend": {
    "edgeLabel": "Connection",
    "colorLabel": "Modularity",
    "nodeLabel": "Game"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "Modularity Class",
    "hoverBehavior": "default"
  },
  "informationPanel": {
    "groupByEdgeDirection": false,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 1.5,
      "minEdgeSize": 0.1,
      "minNodeSize": 2,
      "maxNodeSize": 25
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}
